//Patch by Tim Bedford 2008-08-11
// Generic strings
"OK" = "OK";
"Cancel" = "Cancel";

"Show Main Window" = "Show Main Window";
"Hide Main Window" = "Hide Main Window";
"Show Inspector" = "Show Inspector";
"Hide Inspector" = "Hide Inspector";
"TableInfoTitleFormat" = "\"%@\" Table Info";
"ViewInfoTitleFormat" = "\"%@\" View Info";

// Database status messages
"Not connected" = "Not connected";
"ConnectedToFormat" = "Connected to %@";

// Bonjour strings
"No services found" = "No services found";

// Progress panel messages
"Connecting…" = "Connecting…";
"Refreshing caches" = "Refreshing caches";
"Reloading" = "Reloading";
"Installing BaseTen schema…" = "Installing BaseTen schema…";
"Importing data model" = "Importing data model";
"Reading data model" = "Reading data model";

// Import sheet strings
"Tables" = "Tables";
"Default Configuration" = "Default Configuration";

// Log separators
"beginDryRun" = "\n\n\n---------- Beginning dry run ----------\n\n";
"endDryRun" = "\n----------- Ending dry run ------------\n\n\n";
"beginImport" = "\n\n\n---------- Beginning import -----------\n\n";
"endImport" = "\n------------ Ending import ------------\n\n\n";

// Export Log
"Export Log" = "Export Log";
"Export" = "Export";
"LogExportDefaultName" = "Exported Log";

// Error connecting to PostgreSQL
"CouldntConnectDescription" = "Could not connect to PostgreSQL database";
"CouldntConnectRecoverySuggestion" = "Check that the database is configured to allow connections from this host. See Client Authentication chapter in the PostgreSQL documentation.";

// Errors installing schema
"Could not install BaseTen schema" = "Could not install BaseTen schema";
"Failed to apply BaseTen schma to data base" = "Failed to apply BaseTen schma to data base";
"BaseTen schema definition not found" = "BaseTen schema definition not found";

// Schema needs installing error
"schemaInstallErrorDescription" = "Enabling a view or table requires the BaseTen schema";
"schemaInstallErrorReason" = "Enabling a view or table requires the BaseTen schema";
"schemaInstallRecoverySuggestion" = "BaseTen requires various functions and tables. They will be installed in a separate schema.";
"Install" = "Install";
"Don't Install" = "Don't Install";

// Upgrade schema
"Upgrade BaseTen schema?" = "Upgrade BaseTen schema?";
"schemaUpgradeMessage" = "The installed schema has older version than the one bundled with this application. Would you like to upgrade the database?";
"Upgrade" = "Upgrade";
"Don't Upgrade" = "Don't Upgrade";

// Entity name conflict error
"Replace existing entities with matching names?" = "Replace existing entities with matching names?";
"nameConflictMessage" = "Entities exist in the database that have the same names as some of those selected for import. Would you like to replace the existing entities?";
"Replace" = "Replace";
//End patch

"ModelExportDefaultName" = "Exported Model";
